Revit 2027 API
EdgeEndPoint Methods
The EdgeEndPoint type exposes the following members.
Methods
Name | Description
Dispose
Equals(EdgeEndPoint) |  Determines whether this EdgeEndPoint is equal to another.
Equals(Object) | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Evaluate |  Evaluate the end point of the edge in 3d coordinates.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
EdgeEndPoint Class
Autodesk.Revit.DB Namespace